Repository: CBID2/user-documentation
Catalog: docs/locale/*/LC_MESSAGES/builders/builders.po
Languages: es

source: Creating Themes
es: Crear temas

source: :xref:`MJML` allows marketers to create and maintain beautiful and responsive Themes for Mautic easily.
es: :xref:`MJML` permite a los profesionales del marketing crear y mantener fácilmente temas atractivos y adaptables para Mautic.

source: Why use email Themes?
es: ¿Por qué utilizar Temas de correo electrónico?

source: Purpose of a Theme
es: Objetivo de un tema

source: The GrapesJS builder makes it possible to insert HTML code and edit it in a 'What You See Is What You Get' (WYSIWYG) environment.
es: El constructor GrapesJS permite insertar código HTML y editarlo en un entorno 'What You See Is What You Get' (WYSIWYG).

source: A Theme can feature a wide variety of predefined blocks and sections reflecting the desired Email design - a template from which to start.
es: Un Tema puede incluir una amplia variedad de bloques y secciones predefinidos que reflejen el diseño de Email deseado - una plantilla de la que partir.

source: By choosing a Theme, you can create beautiful Emails very efficiently.
es: Eligiendo un Tema, puedes crear hermosos Emails muy eficientemente.

source: Modifying legacy Themes
es: Modificar los temas heredados

source: The GrapesJS Builder checks the Theme configuration file before listing the available Themes, to determine which are compatible with the Builder.
es: El GrapesJS Builder comprueba el archivo de configuración del tema antes de listar los temas disponibles, para determinar cuáles son compatibles con el Builder.

source: Since :xref:`Mautic 3` a new line defines the compatible Builders:
es: Desde :xref:`Mautic 3` una nueva línea define los Constructores compatibles:

source: File name: config.json
es: Nombre del archivo: config.json

source: With the builder/s defined, the Theme shows in the Theme selection page.
es: Con el/los constructor/es definido/s, el Tema se muestra en la página de selección de Tema.

source: If you wish to support more than one Builder, specify them in an array: ``"builder": ["legacy", "grapesjsbuilder"],``
es: Si desea admitir más de un constructor, especifíquelos en una matriz: ``"builder": ["legacy", "grapesjsbuilder"],``

source: Creating a Theme from scratch
es: Creación de un tema desde cero

source: HTML markup
es: Marcado HTML

source: It's possible to use HTML for Themes, and the GrapesJS builder offers basic WYSIWYG editing capabilities.
es: Es posible utilizar HTML para los temas, y el constructor GrapesJS ofrece capacidades básicas de edición WYSIWYG.

source: Once converted into HTML, however, the structure is table based, and the blocks are hard to move around. For this reason, MJML Themes are preferable.
es: Sin embargo, una vez convertidos a HTML, la estructura se basa en tablas y los bloques son difíciles de desplazar. Por esta razón, son preferibles los temas MJML.

source: MJML markup
es: Marcado MJML

source: The MJML language allows the creation of blocks which can be freely moved around in the editor, changing the layout fundamentally without coding.
es: El lenguaje MJML permite crear bloques que pueden desplazarse libremente por el editor, cambiando el diseño fundamentalmente sin codificar.

source: In order to harness the power of MJML, you must code the whole Theme in MJML.
es: Para aprovechar la potencia de MJML, debe codificar todo el Tema en MJML.

source: The best place to do so is the online editor at :xref:`MJML`.
es: El mejor lugar para hacerlo es el editor en línea en :xref:`MJML`.

source: Documentation on using sections, columns, and blocks is available in the :xref:`MJML Documentation`
es: La documentación sobre el uso de secciones, columnas y bloques está disponible en :xref:`Documentación MJML`.

source: Head Components
es: Componentes principales

source: At present, Mautic won't process the ``<mj-head>`` tags. None of the ``<mj-attribuites>`` run, so you have to do all styling inline.
es: Actualmente, Mautic no procesa las etiquetas ``<mj-head>``. Ninguno de los ``<mj-attribuites>`` se ejecuta, por lo que tiene que hacer todo el estilo en línea.

source: Body Components
es: Componentes del cuerpo

source: At present, Mautic processes most ``<mj-body>`` components.
es: En la actualidad, Mautic procesa la mayoría de los componentes de ``<mj-body>``.

source: **Tested elements** are: mj-button, mj-column, mj-divider, mj-image, mj-navbar, mj-section, mj-spacer, mj-text
es: **Los elementos probados** son: mj-button, mj-column, mj-divider, mj-image, mj-navbar, mj-section, mj-spacer, mj-text.

source: Image Asset relative URLs
es: URL relativas de los activos de imagen

source: Images have to refer to the Themes folder the following way:
es: Las imágenes tienen que referirse a la carpeta Temas de la siguiente manera:

source: File structure
es: Estructura de los archivos

source: Steps to save the Theme package
es: Pasos para guardar el paquete Tema

source: Once your design in MJML is finalized, go through the following steps to create the Theme package:
es: Una vez finalizado su diseño en MJML, siga los siguientes pasos para crear el paquete de temas:

source: Save your images in the Assets folder.
es: Guarde las imágenes en la carpeta Assets.

source: Save your MJML in the ``html`` folder as ``email.mjml.twig`` AND ``email.html.twig``.
es: Guarda tu MJML en la carpeta ``html`` como ``email.mjml.twig`` Y ``email.html.twig``.

source: Use the ``base.html.twig`` and ``message.html.twig`` files from the basic Theme or make your changes there.
es: Utilice los archivos ``base.html.twig`` y ``message.html.twig`` del Tema básico o haga sus cambios allí.

source: Save your ``config.json`` as described previously
es: Guarde su ``config.json`` como se ha descrito anteriormente

source: Create a thumbnail - use the dimensions of 400px wide, 600px high.
es: Cree una miniatura - utilice las dimensiones de 400px de ancho, 600px de alto.

source: Compress the contents of the folder as a Zip file - ensure that the files and folders aren't within a sub-folder in the Zip file.
es: Comprime el contenido de la carpeta como un archivo Zip - asegúrate de que los archivos y carpetas no están dentro de una subcarpeta en el archivo Zip.

source: Email & Landing Page Builder
es: Generador de Emails y Páginas de Destino

source: Since :xref:`Mautic 3`, Mautic has shipped with an updated, modern Builder for creating Emails and Landing Pages. In :xref:`Mautic 4` it's the default Builder.
es: Desde :xref:`Mautic 3`, Mautic incluye un constructor actualizado y moderno para crear emails y páginas de destino. En :xref:`Mautic 4` es el constructor por defecto.

source: To use your existing templates with the new Builder, you need to add one line to your configuration file. Read on for further details.
es: Para utilizar tus plantillas existentes con el nuevo constructor, debe añadir una línea a su archivo de configuración. Siga leyendo para más detalles.

source: About GrapesJS
es: Acerca de GrapesJS

source: :xref:`Webmecanik` initiated the new Email and landing page as an MVP. After developing and improving it using the open source :xref:`GrapesJS` framework, :xref:`Aivie` kindly made it available to the Mautic community.
es: :xref:`Webmecanik` inició el nuevo Email y la página de aterrizaje como un MVP. Tras desarrollarla y mejorarla utilizando el framework de código abierto :xref:`GrapesJS`, :xref:`Aivie` tuvo la amabilidad de ponerla a disposición de la comunidad Mautic.

source: GrapesJS is an open source, multi-purpose, Web Builder Framework which combines different tools and features with the goal to help build HTML templates without any knowledge of coding.
es: GrapesJS es un framework constructor web multipropósito de código abierto que combina diferentes herramientas y características con el objetivo de ayudar a construir plantillas HTML sin ningún conocimiento de codificación.

source: Available end-user features
es: Funciones disponibles para el usuario

source: Drag & drop built-in blocks
es: Bloques integrados para arrastrar y soltar

source: GrapesJS comes with a set of built-in blocks, in this way you're able to build your templates faster. If the default set isn't enough you can always add your own custom blocks.
es: GrapesJS viene con un conjunto de bloques incorporados, de esta forma podrás construir tus plantillas más rápidamente. Si el conjunto predeterminado no es suficiente, siempre puedes añadir tus propios bloques personalizados.

source: Limitless styling
es: Estilo sin límites

source: GrapesJS implements a simple and powerful Style Manager module which enables independent styling of any Component inside the canvas. It's also possible to configure it to use any of the CSS properties.
es: GrapesJS implementa un sencillo y potente módulo Style Manager que permite aplicar estilos independientes a cualquier componente dentro del canvas. También es posible configurarlo para utilizar cualquiera de las propiedades CSS.

source: Responsive design
es: Diseño responsivo

source: GrapesJS gives you all the necessary tools you need to optimize your templates to look awesomely on any device. In this way you're able to provide various viewing experiences. In case you require more device options, you can easily add them to the editor.
es: GrapesJS te ofrece todas las herramientas necesarias para optimizar tus plantillas de forma que se vean de maravilla en cualquier dispositivo. De este modo, podrás ofrecer distintas experiencias de visualización. En caso de que necesites más opciones de dispositivo, puedes añadirlas fácilmente al editor.

source: The structure always under control
es: La estructura siempre controlada

source: You can nest Components as much as you can but when the structure begins to grow the Layer Manager comes very handy. It allows you to manage and rearrange your elements extremely fast, focusing always on the architecture of your structure.
es: Puedes anidar Componentes tanto como puedas, pero cuando la estructura empieza a crecer, el Gestor de Capas resulta muy útil. Te permite gestionar y reorganizar tus elementos de forma extremadamente rápida, centrándose siempre en la arquitectura de tu estructura.

source: The code is there when you need it
es: El código está ahí cuando lo necesitas

source: You don't have to care about the code, but it's always there, available for you. When it's done, you can grab it and use it wherever you want. Developers could also implement their own storage interfaces to use inside the editor.
es: No tienes que preocuparte por el código, pero siempre está ahí, disponible para ti. Cuando esté terminado, puedes cogerlo y usarlo donde quieras. Los desarrolladores también podrían implementar sus propias interfaces de almacenamiento para utilizarlas dentro del editor.

source: Asset manager
es: Gestor de activos

source: With the Asset Manager is easier to organize your media files and it's enough to double click the image to change it.
es: Con el Gestor de Activos es más fácil organizar tus archivos multimedia y basta con hacer doble clic en la imagen para cambiarla.

source: About the builder
es: Acerca del constructor

source: Enabling the builder
es: Activar el constructor

source: Since Mautic 3.3-RC1 the Builder is available to enable in the Plugins section of Mautic. Go to the Settings by clicking the cog wheel at the top right > Plugins > GrapesJS and click the GrapesJS icon. Change the slider to Yes.
es: Desde Mautic 3.3-RC1 se puede activar el Constructor en la sección Plugins de Mautic. Ve a Configuración haciendo clic en la rueda dentada de la parte superior derecha > Plugins > GrapesJS y haz clic en el icono GrapesJS. Cambia el control deslizante a Sí.

source: Now you need to **clear your Mautic cache** located in ``var/cache`` and refresh the Landing Page before you can work with the new GrapesJS Builder. Some browsers may also require you to clear the browser cache.
es: Ahora necesitas **borrar tu caché de Mautic** localizado en ``var/cache`` y refrescar la Landing Page antes de poder trabajar con el nuevo GrapesJS Builder. Algunos navegadores también pueden requerir que borres la caché del navegador.

source: By default, Mautic 4 activates the new Builder. Follow the previous steps to revert to the legacy Builder, remembering to clear the cache and reload the Landing Page.
es: Por defecto, Mautic 4 activa el nuevo Constructor. Siga los pasos anteriores para volver al Constructor anterior, recordando borrar la caché y volver a cargar la página de destino.

source: Email builder overview
es: Visión general del generador de correo electrónico

source: Screenshot of the editor overview
es: Captura de pantalla del editor

source: The functions of the Email Builder are as follows:
es: Las funciones del constructor de email son las siguientes:

source: You can select different screen size to preview your Emails.
es: Puedes seleccionar diferentes tamaños de pantalla para previsualizar tus Emails.

source: You have the ability to undo and redo your changes.
es: Tienes la posibilidad de deshacer y rehacer los cambios.

source: Editor functions from left to right: display grids, Full screen view, export MJML / HTML code, Edit code, display customization options, display blocks, close editor.
es: Funciones del editor de izquierda a derecha: mostrar rejillas, vista a pantalla completa, exportar código MJML / HTML, editar código, mostrar opciones de personalización, mostrar bloques, cerrar editor.

source: Layout sections. These objects function as the basic structure of your design. Create your Email structure from sections, and pull in the different blocks you want to use.
es: Secciones de diseño. Estos objetos funcionan como la estructura básica de su diseño. Crea tu estructura de correo electrónico a partir de secciones, y tira de los diferentes bloques que desee utilizar.

source: Content blocks. You can populate your newsletter with these content blocks. Each block has specific layout, settings and design.
es: Bloques de contenido. Puedes rellenar tu boletín con estos bloques de contenido. Cada bloque tiene una disposición, configuración y diseño específicos.

source: Templates
es: Plantillas

source: To use your existing templates with the new Builder, you need to add one line to your configuration file in the template folder:
es: Para utilizar tus plantillas existentes con el nuevo Builder, debes añadir una línea a su archivo de configuración en la carpeta de plantillas:

source: If you wish to use the Theme in multiple builders, you can use this syntax:
es: Si deseas utilizar el tema en varios constructores, puede utilizar esta sintaxis:

source: This syntax changed between Mautic 3.3.* and Mautic 4 to enable support for multiple Builders - if you have been testing in the beta phase you need to update your configuration files to avoid a 500 error.
es: Esta sintaxis cambió entre Mautic 3.3.* y Mautic 4 para permitir el soporte de múltiples Constructores - si has estado probando en la fase beta necesitas actualizar tus archivos de configuración para evitar un error 500.

source: The blank Theme contains an example of a full configuration file:
es: El tema en blanco contiene un ejemplo de archivo de configuración completo:

source: From the 3.3 General Availability release there are be three Email templates that support MJML.
es: A partir de la versión 3.3 General Availability habrá tres plantillas de correo electrónico compatibles con MJML.

source: Themes
es: Temas

source: If you search through the list of available Themes, the new MJML Themes ``Brienz``, ``Paprika`` and ``Confirm Me`` display only with the new Builder.
es: Si busca en la lista de temas disponibles, los nuevos temas MJML ``Brienz``, ``Paprika`` y ``Confírmame`` sólo se muestran con el nuevo Constructor.

source: To learn more about creating Themes please :doc:`check the documentation</builders/creating_themes>`.
es: Para obtener más información sobre la creación de temas, consulte la documentación</builders/creating_themes>`.

source: Reporting bugs
es: Informar de errores

source: Known bugs / issues
es: Errores / problemas conocidos

source: Please use the issue queue on the :xref:`GitHub repository` to find the latest updates and Report bugs with the Plugin. Be sure to search first in case someone has already reported the bug.
es: Por favor, utiliza la cola de problemas en el repositorio :xref:`GitHub` para encontrar las últimas actualizaciones y reportar errores con el plugin. Asegúrate de buscar primero en caso de que alguien ya ha reportado el error.

source: Switching back to the legacy Builder
es: Volver al constructor heredado

source: In case you aren't happy with the Plugin at the moment, you can easily switch back to the legacy Builder (original Mautic Builder). You can do so very quickly:
es: En caso de que no estes satisfecho con el Plugin por el momento, puedes volver fácilmente al constructor heredado (Mautic Builder original). Puedes hacerlo muy rápidamente:

source: Go to Mautic Settings > Click the cogwheel on the right-hand top corner
es: En ajustes de Mautic > Haz clic en la rueda dentada de la esquina superior derecha

source: Open the Plugins Directory > click "Plugins" inside the menu
es: Abre el directorio de Plugins > haz clic en "Plugins" dentro del menú

source: Find the GrapesJs Plugin and click it > Click "No" and then "Save and Close"
es: Busca el plugin GrapesJs y haz clic en él > Haz clic en "No" y luego en "Guardar y cerrar".

source: Clear the cache and reload the Landing Page - you may also need to clear your browser cache.
es: Borra la memoria caché y vuelve a cargar la página de aterrizaje; es posible que también tengas que borrar la memoria caché de tu navegador.

source: After unloading GrapesJs Plugin, the legacy Builder becomes active again.
es: Tras descargar el plugin GrapesJs, el constructor de legados vuelve a estar activo.

source: Thanks and credits
es: Agradecimientos y créditos

source: Thank you to everyone who contributed to this project. Special thanks to Adrian Schimpf from :xref:`Aivie` for all their hard work in leading the project, to :xref:`Webmecanik` for initializing this amazing new builder and to Joey from :xref:`Friendly Automate` for donating three Email Themes to the Community. Additional contributions: Alex Hammerschmied from :xref:`hartmut.io`, Dennis Ameling.
es: Gracias a todos los que han contribuido a este proyecto. Un agradecimiento especial a Adrian Schimpf de :xref:`Aivie` por todo su duro trabajo liderando el proyecto, a :xref:`Webmecanik` por inicializar este increíble nuevo constructor y a Joey de :xref:`Friendly Automate` por donar tres Temas de Email a la Comunidad. Contribuciones adicionales: Alex Hammerschmied de :xref:`hartmut.io`, Dennis Ameling.

source: And of course a really big thank you to all the contributors who have helped to bring this project to this point.
es: Y, por supuesto, muchas gracias a todos los colaboradores que han ayudado a llevar este proyecto hasta aquí.
